; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-7-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	p0-9 - location
	p1-3 - location
	p1-6 - location
	p3-1 - location
	p3-5 - location
	p3-10 - location
	p4-0 - location
	p5-8 - location
	p5-10 - location
	p6-1 - location
	p6-7 - location
	p8-2 - location
	p8-4 - location
	p9-3 - location
	p9-4 - location
	p10-2 - location
	p10-9 - location
	)
	(:init
	(at driver1 s7)
	(at driver2 s5)
	(at driver3 s9)
	(at driver4 s6)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s6)
	(empty truck5)
	(at truck6 s4)
	(empty truck6)
	(at truck7 s7)
	(empty truck7)
	(at package1 s0)
	(at package2 s4)
	(at package3 s2)
	(at package4 s0)
	(at package5 s3)
	(at package6 s1)
	(at package7 s5)
	(at package8 s3)
	(at package9 s4)
	(path s0 p0-9)
	(path p0-9 s0)
	(path s9 p0-9)
	(path p0-9 s9)
	(= (time-to-walk s0 p0-9) 74)
	(= (time-to-walk p0-9 s0) 74)
	(= (time-to-walk s9 p0-9) 3)
	(= (time-to-walk p0-9 s9) 3)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 20)
	(= (time-to-walk p1-3 s1) 20)
	(= (time-to-walk s3 p1-3) 20)
	(= (time-to-walk p1-3 s3) 20)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 10)
	(= (time-to-walk p1-6 s1) 10)
	(= (time-to-walk s6 p1-6) 19)
	(= (time-to-walk p1-6 s6) 19)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 58)
	(= (time-to-walk p3-5 s3) 58)
	(= (time-to-walk s5 p3-5) 50)
	(= (time-to-walk p3-5 s5) 50)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(= (time-to-walk s3 p3-10) 2)
	(= (time-to-walk p3-10 s3) 2)
	(= (time-to-walk s10 p3-10) 25)
	(= (time-to-walk p3-10 s10) 25)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 74)
	(= (time-to-walk p4-0 s4) 74)
	(= (time-to-walk s0 p4-0) 40)
	(= (time-to-walk p4-0 s0) 40)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(= (time-to-walk s5 p5-8) 97)
	(= (time-to-walk p5-8 s5) 97)
	(= (time-to-walk s8 p5-8) 82)
	(= (time-to-walk p5-8 s8) 82)
	(path s5 p5-10)
	(path p5-10 s5)
	(path s10 p5-10)
	(path p5-10 s10)
	(= (time-to-walk s5 p5-10) 9)
	(= (time-to-walk p5-10 s5) 9)
	(= (time-to-walk s10 p5-10) 33)
	(= (time-to-walk p5-10 s10) 33)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(= (time-to-walk s6 p6-7) 14)
	(= (time-to-walk p6-7 s6) 14)
	(= (time-to-walk s7 p6-7) 92)
	(= (time-to-walk p6-7 s7) 92)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(= (time-to-walk s8 p8-2) 50)
	(= (time-to-walk p8-2 s8) 50)
	(= (time-to-walk s2 p8-2) 28)
	(= (time-to-walk p8-2 s2) 28)
	(path s8 p8-4)
	(path p8-4 s8)
	(path s4 p8-4)
	(path p8-4 s4)
	(= (time-to-walk s8 p8-4) 4)
	(= (time-to-walk p8-4 s8) 4)
	(= (time-to-walk s4 p8-4) 100)
	(= (time-to-walk p8-4 s4) 100)
	(path s9 p9-3)
	(path p9-3 s9)
	(path s3 p9-3)
	(path p9-3 s3)
	(= (time-to-walk s9 p9-3) 80)
	(= (time-to-walk p9-3 s9) 80)
	(= (time-to-walk s3 p9-3) 36)
	(= (time-to-walk p9-3 s3) 36)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(= (time-to-walk s9 p9-4) 81)
	(= (time-to-walk p9-4 s9) 81)
	(= (time-to-walk s4 p9-4) 13)
	(= (time-to-walk p9-4 s4) 13)
	(path s10 p10-2)
	(path p10-2 s10)
	(path s2 p10-2)
	(path p10-2 s2)
	(= (time-to-walk s10 p10-2) 23)
	(= (time-to-walk p10-2 s10) 23)
	(= (time-to-walk s2 p10-2) 81)
	(= (time-to-walk p10-2 s2) 81)
	(path s10 p10-9)
	(path p10-9 s10)
	(path s9 p10-9)
	(path p10-9 s9)
	(= (time-to-walk s10 p10-9) 51)
	(= (time-to-walk p10-9 s10) 51)
	(= (time-to-walk s9 p10-9) 55)
	(= (time-to-walk p10-9 s9) 55)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 56)
	(= (time-to-drive s7 s0) 56)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 25)
	(= (time-to-drive s8 s0) 25)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 57)
	(= (time-to-drive s2 s1) 57)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 75)
	(= (time-to-drive s7 s2) 75)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 44)
	(= (time-to-drive s8 s2) 44)
	(link s2 s9)
	(link s9 s2)
	(= (time-to-drive s2 s9) 66)
	(= (time-to-drive s9 s2) 66)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 94)
	(= (time-to-drive s0 s3) 94)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 1)
	(= (time-to-drive s4 s3) 1)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 15)
	(= (time-to-drive s1 s4) 15)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 95)
	(= (time-to-drive s5 s4) 95)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 26)
	(= (time-to-drive s7 s4) 26)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 89)
	(= (time-to-drive s9 s4) 89)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 35)
	(= (time-to-drive s1 s5) 35)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 22)
	(= (time-to-drive s6 s5) 22)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 70)
	(= (time-to-drive s8 s5) 70)
	(link s5 s9)
	(link s9 s5)
	(= (time-to-drive s5 s9) 43)
	(= (time-to-drive s9 s5) 43)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 54)
	(= (time-to-drive s2 s6) 54)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 83)
	(= (time-to-drive s4 s6) 83)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 35)
	(= (time-to-drive s1 s7) 35)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 3)
	(= (time-to-drive s3 s7) 3)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 11)
	(= (time-to-drive s6 s7) 11)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 39)
	(= (time-to-drive s8 s7) 39)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 3)
	(= (time-to-drive s1 s8) 3)
	(link s9 s0)
	(link s0 s9)
	(= (time-to-drive s9 s0) 91)
	(= (time-to-drive s0 s9) 91)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 74)
	(= (time-to-drive s3 s9) 74)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 84)
	(= (time-to-drive s6 s9) 84)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 3)
	(= (time-to-drive s8 s9) 3)
	(link s9 s10)
	(link s10 s9)
	(= (time-to-drive s9 s10) 96)
	(= (time-to-drive s10 s9) 96)
	(link s10 s6)
	(link s6 s10)
	(= (time-to-drive s10 s6) 64)
	(= (time-to-drive s6 s10) 64)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 53)
	(= (time-to-drive s7 s10) 53)
	(link s10 s8)
	(link s8 s10)
	(= (time-to-drive s10 s8) 50)
	(= (time-to-drive s8 s10) 50)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s10)
	(at driver3 s3)
	(at driver4 s0)
	(at truck2 s8)
	(at truck3 s3)
	(at truck4 s3)
	(at truck6 s8)
	(at truck7 s4)
	(at package1 s10)
	(at package2 s9)
	(at package3 s4)
	(at package4 s7)
	(at package5 s9)
	(at package6 s1)
	(at package7 s3)
	(at package9 s3)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 4  (driven))) (* 1  (walked))))

)

; plan
1. (board-truck driver1 truck7 s7)
   deleted: (at driver1 s7) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 2 of 17
2. (drive-truck truck7 s7 s2 driver1)
   deleted: (at truck7 s7)
   added: (at truck7 s2)
   changed: (driven) from 0 to 75
   goals met: 2 of 17
3. (walk driver3 s9 p9-4)
   deleted: (at driver3 s9)
   added: (at driver3 p9-4)
   changed: (walked) from 0 to 81
   goals met: 2 of 17
4. (walk driver3 p9-4 s4)
   deleted: (at driver3 p9-4)
   added: (at driver3 s4)
   changed: (walked) from 81 to 94
   goals met: 2 of 17
5. (load-truck package2 truck6 s4)
   deleted: (at package2 s4)
   added: (in package2 truck6)
   goals met: 2 of 17
6. (board-truck driver3 truck6 s4)
   deleted: (at driver3 s4) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 2 of 17
7. (load-truck package3 truck7 s2)
   deleted: (at package3 s2)
   added: (in package3 truck7)
   goals met: 2 of 17
8. (walk driver2 s5 p5-10)
   deleted: (at driver2 s5)
   added: (at driver2 p5-10)
   changed: (walked) from 94 to 103
   goals met: 2 of 17
9. (load-truck package9 truck6 s4)
   deleted: (at package9 s4)
   added: (in package9 truck6)
   goals met: 2 of 17
10. (drive-truck truck6 s4 s9 driver3)
   deleted: (at truck6 s4)
   added: (at truck6 s9)
   changed: (driven) from 75 to 164
   goals met: 2 of 17
11. (walk driver2 p5-10 s10)
   deleted: (at driver2 p5-10)
   added: (at driver2 s10)
   changed: (walked) from 103 to 136
   goals met: 3 of 17
12. (drive-truck truck6 s9 s0 driver3)
   deleted: (at truck6 s9)
   added: (at truck6 s0)
   changed: (driven) from 164 to 255
   goals met: 3 of 17
13. (walk driver4 s6 p1-6)
   deleted: (at driver4 s6)
   added: (at driver4 p1-6)
   changed: (walked) from 136 to 155
   goals met: 3 of 17
14. (walk driver4 p1-6 s1)
   deleted: (at driver4 p1-6)
   added: (at driver4 s1)
   changed: (walked) from 155 to 165
   goals met: 3 of 17
15. (drive-truck truck6 s0 s3 driver3)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   changed: (driven) from 255 to 349
   goals met: 3 of 17
16. (unload-truck package9 truck6 s3)
   deleted: (in package9 truck6)
   added: (at package9 s3)
   goals met: 4 of 17
17. (load-truck package5 truck6 s3)
   deleted: (at package5 s3)
   added: (in package5 truck6)
   goals met: 4 of 17
18. (drive-truck truck6 s3 s9 driver3)
   deleted: (at truck6 s3)
   added: (at truck6 s9)
   changed: (driven) from 349 to 423
   goals met: 4 of 17
19. (unload-truck package5 truck6 s9)
   deleted: (in package5 truck6)
   added: (at package5 s9)
   goals met: 5 of 17
20. (drive-truck truck6 s9 s0 driver3)
   deleted: (at truck6 s9)
   added: (at truck6 s0)
   changed: (driven) from 423 to 514
   goals met: 5 of 17
21. (load-truck package1 truck6 s0)
   deleted: (at package1 s0)
   added: (in package1 truck6)
   goals met: 5 of 17
22. (load-truck package4 truck6 s0)
   deleted: (at package4 s0)
   added: (in package4 truck6)
   goals met: 5 of 17
23. (drive-truck truck6 s0 s3 driver3)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   changed: (driven) from 514 to 608
   goals met: 5 of 17
24. (drive-truck truck7 s2 s1 driver1)
   deleted: (at truck7 s2)
   added: (at truck7 s1)
   changed: (driven) from 608 to 665
   goals met: 5 of 17
25. (board-truck driver4 truck2 s1)
   deleted: (at driver4 s1) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 5 of 17
26. (drive-truck truck2 s1 s8 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s8)
   changed: (driven) from 665 to 668
   goals met: 6 of 17
27. (drive-truck truck6 s3 s9 driver3)
   deleted: (at truck6 s3)
   added: (at truck6 s9)
   changed: (driven) from 668 to 742
   goals met: 6 of 17
28. (disembark-truck driver1 truck7 s1)
   deleted: (driving driver1 truck7)
   added: (at driver1 s1) (empty truck7)
   goals met: 7 of 17
29. (drive-truck truck2 s8 s0 driver4)
   deleted: (at truck2 s8)
   added: (at truck2 s0)
   changed: (driven) from 742 to 767
   goals met: 6 of 17
30. (disembark-truck driver4 truck2 s0)
   deleted: (driving driver4 truck2)
   added: (at driver4 s0) (empty truck2)
   goals met: 7 of 17
31. (unload-truck package2 truck6 s9)
   deleted: (in package2 truck6)
   added: (at package2 s9)
   goals met: 8 of 17
32. (board-truck driver1 truck7 s1)
   deleted: (at driver1 s1) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 7 of 17
33. (drive-truck truck6 s9 s10 driver3)
   deleted: (at truck6 s9)
   added: (at truck6 s10)
   changed: (driven) from 767 to 863
   goals met: 7 of 17
34. (unload-truck package1 truck6 s10)
   deleted: (in package1 truck6)
   added: (at package1 s10)
   goals met: 8 of 17
35. (drive-truck truck6 s10 s7 driver3)
   deleted: (at truck6 s10)
   added: (at truck6 s7)
   changed: (driven) from 863 to 916
   goals met: 8 of 17
36. (walk driver2 s10 p10-2)
   deleted: (at driver2 s10)
   added: (at driver2 p10-2)
   changed: (walked) from 165 to 188
   goals met: 7 of 17
37. (drive-truck truck7 s1 s4 driver1)
   deleted: (at truck7 s1)
   added: (at truck7 s4)
   changed: (driven) from 916 to 931
   goals met: 8 of 17
38. (unload-truck package3 truck7 s4)
   deleted: (in package3 truck7)
   added: (at package3 s4)
   goals met: 9 of 17
39. (walk driver2 p10-2 s2)
   deleted: (at driver2 p10-2)
   added: (at driver2 s2)
   changed: (walked) from 188 to 269
   goals met: 9 of 17
40. (unload-truck package4 truck6 s7)
   deleted: (in package4 truck6)
   added: (at package4 s7)
   goals met: 10 of 17
41. (drive-truck truck7 s4 s1 driver1)
   deleted: (at truck7 s4)
   added: (at truck7 s1)
   changed: (driven) from 931 to 946
   goals met: 9 of 17
42. (disembark-truck driver1 truck7 s1)
   deleted: (driving driver1 truck7)
   added: (at driver1 s1) (empty truck7)
   goals met: 10 of 17
43. (drive-truck truck6 s7 s8 driver3)
   deleted: (at truck6 s7)
   added: (at truck6 s8)
   changed: (driven) from 946 to 985
   goals met: 11 of 17
44. (board-truck driver4 truck2 s0)
   deleted: (at driver4 s0) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 10 of 17
45. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 10 of 17
46. (drive-truck truck6 s8 s5 driver3)
   deleted: (at truck6 s8)
   added: (at truck6 s5)
   changed: (driven) from 985 to 1055
   goals met: 9 of 17
47. (load-truck package7 truck6 s5)
   deleted: (at package7 s5)
   added: (in package7 truck6)
   goals met: 9 of 17
48. (drive-truck truck6 s5 s8 driver3)
   deleted: (at truck6 s5)
   added: (at truck6 s8)
   changed: (driven) from 1055 to 1125
   goals met: 10 of 17
49. (drive-truck truck6 s8 s9 driver3)
   deleted: (at truck6 s8)
   added: (at truck6 s9)
   changed: (driven) from 1125 to 1128
   goals met: 9 of 17
50. (drive-truck truck4 s2 s9 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s9)
   changed: (driven) from 1128 to 1194
   goals met: 9 of 17
51. (drive-truck truck4 s9 s3 driver2)
   deleted: (at truck4 s9)
   added: (at truck4 s3)
   changed: (driven) from 1194 to 1268
   goals met: 10 of 17
52. (disembark-truck driver2 truck4 s3)
   deleted: (driving driver2 truck4)
   added: (at driver2 s3) (empty truck4)
   goals met: 10 of 17
53. (walk driver2 s3 p3-10)
   deleted: (at driver2 s3)
   added: (at driver2 p3-10)
   changed: (walked) from 269 to 271
   goals met: 10 of 17
54. (walk driver2 p3-10 s10)
   deleted: (at driver2 p3-10)
   added: (at driver2 s10)
   changed: (walked) from 271 to 296
   goals met: 11 of 17
55. (drive-truck truck6 s9 s3 driver3)
   deleted: (at truck6 s9)
   added: (at truck6 s3)
   changed: (driven) from 1268 to 1342
   goals met: 11 of 17
56. (unload-truck package7 truck6 s3)
   deleted: (in package7 truck6)
   added: (at package7 s3)
   goals met: 12 of 17
57. (drive-truck truck6 s3 s7 driver3)
   deleted: (at truck6 s3)
   added: (at truck6 s7)
   changed: (driven) from 1342 to 1345
   goals met: 12 of 17
58. (drive-truck truck6 s7 s8 driver3)
   deleted: (at truck6 s7)
   added: (at truck6 s8)
   changed: (driven) from 1345 to 1384
   goals met: 13 of 17
59. (disembark-truck driver3 truck6 s8)
   deleted: (driving driver3 truck6)
   added: (at driver3 s8) (empty truck6)
   goals met: 13 of 17
60. (disembark-truck driver4 truck2 s0)
   deleted: (driving driver4 truck2)
   added: (at driver4 s0) (empty truck2)
   goals met: 14 of 17
61. (walk driver3 s8 p5-8)
   deleted: (at driver3 s8)
   added: (at driver3 p5-8)
   changed: (walked) from 296 to 378
   goals met: 14 of 17
62. (board-truck driver4 truck2 s0)
   deleted: (at driver4 s0) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 13 of 17
63. (drive-truck truck2 s0 s8 driver4)
   deleted: (at truck2 s0)
   added: (at truck2 s8)
   changed: (driven) from 1384 to 1409
   goals met: 14 of 17
64. (board-truck driver1 truck7 s1)
   deleted: (at driver1 s1) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 13 of 17
65. (drive-truck truck7 s1 s4 driver1)
   deleted: (at truck7 s1)
   added: (at truck7 s4)
   changed: (driven) from 1409 to 1424
   goals met: 14 of 17
66. (disembark-truck driver4 truck2 s8)
   deleted: (driving driver4 truck2)
   added: (at driver4 s8) (empty truck2)
   goals met: 14 of 17
67. (walk driver3 p5-8 s5)
   deleted: (at driver3 p5-8)
   added: (at driver3 s5)
   changed: (walked) from 378 to 475
   goals met: 14 of 17
68. (walk driver3 s5 p3-5)
   deleted: (at driver3 s5)
   added: (at driver3 p3-5)
   changed: (walked) from 475 to 525
   goals met: 14 of 17
69. (walk driver3 p3-5 s3)
   deleted: (at driver3 p3-5)
   added: (at driver3 s3)
   changed: (walked) from 525 to 583
   goals met: 15 of 17
70. (drive-truck truck7 s4 s1 driver1)
   deleted: (at truck7 s4)
   added: (at truck7 s1)
   changed: (driven) from 1424 to 1439
   goals met: 14 of 17
71. (drive-truck truck7 s1 s8 driver1)
   deleted: (at truck7 s1)
   added: (at truck7 s8)
   changed: (driven) from 1439 to 1442
   goals met: 14 of 17
72. (disembark-truck driver1 truck7 s8)
   deleted: (driving driver1 truck7)
   added: (at driver1 s8) (empty truck7)
   goals met: 14 of 17
73. (board-truck driver4 truck7 s8)
   deleted: (at driver4 s8) (empty truck7)
   added: (driving driver4 truck7)
   goals met: 14 of 17
74. (board-truck driver1 truck2 s8)
   deleted: (at driver1 s8) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 14 of 17
75. (drive-truck truck2 s8 s1 driver1)
   deleted: (at truck2 s8)
   added: (at truck2 s1)
   changed: (driven) from 1442 to 1445
   goals met: 13 of 17
76. (drive-truck truck7 s8 s1 driver4)
   deleted: (at truck7 s8)
   added: (at truck7 s1)
   changed: (driven) from 1445 to 1448
   goals met: 13 of 17
77. (drive-truck truck2 s1 s8 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s8)
   changed: (driven) from 1448 to 1451
   goals met: 14 of 17
78. (drive-truck truck2 s8 s0 driver1)
   deleted: (at truck2 s8)
   added: (at truck2 s0)
   changed: (driven) from 1451 to 1476
   goals met: 13 of 17
79. (drive-truck truck7 s1 s7 driver4)
   deleted: (at truck7 s1)
   added: (at truck7 s7)
   changed: (driven) from 1476 to 1511
   goals met: 13 of 17
80. (drive-truck truck7 s7 s0 driver4)
   deleted: (at truck7 s7)
   added: (at truck7 s0)
   changed: (driven) from 1511 to 1567
   goals met: 13 of 17
81. (disembark-truck driver4 truck7 s0)
   deleted: (driving driver4 truck7)
   added: (at driver4 s0) (empty truck7)
   goals met: 14 of 17
82. (disembark-truck driver1 truck2 s0)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 14 of 17
83. (board-truck driver1 truck7 s0)
   deleted: (at driver1 s0) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 14 of 17
84. (board-truck driver4 truck2 s0)
   deleted: (at driver4 s0) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 13 of 17
85. (drive-truck truck2 s0 s8 driver4)
   deleted: (at truck2 s0)
   added: (at truck2 s8)
   changed: (driven) from 1567 to 1592
   goals met: 14 of 17
86. (drive-truck truck7 s0 s9 driver1)
   deleted: (at truck7 s0)
   added: (at truck7 s9)
   changed: (driven) from 1592 to 1683
   goals met: 14 of 17
87. (drive-truck truck2 s8 s0 driver4)
   deleted: (at truck2 s8)
   added: (at truck2 s0)
   changed: (driven) from 1683 to 1708
   goals met: 13 of 17
88. (disembark-truck driver1 truck7 s9)
   deleted: (driving driver1 truck7)
   added: (at driver1 s9) (empty truck7)
   goals met: 13 of 17
89. (disembark-truck driver4 truck2 s0)
   deleted: (driving driver4 truck2)
   added: (at driver4 s0) (empty truck2)
   goals met: 14 of 17
90. (walk driver1 s9 p9-3)
   deleted: (at driver1 s9)
   added: (at driver1 p9-3)
   changed: (walked) from 583 to 663
   goals met: 14 of 17
91. (walk driver1 p9-3 s3)
   deleted: (at driver1 p9-3)
   added: (at driver1 s3)
   changed: (walked) from 663 to 699
   goals met: 14 of 17
92. (walk driver1 s3 p1-3)
   deleted: (at driver1 s3)
   added: (at driver1 p1-3)
   changed: (walked) from 699 to 719
   goals met: 14 of 17
93. (board-truck driver4 truck2 s0)
   deleted: (at driver4 s0) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 13 of 17
94. (drive-truck truck2 s0 s9 driver4)
   deleted: (at truck2 s0)
   added: (at truck2 s9)
   changed: (driven) from 1708 to 1799
   goals met: 13 of 17
95. (disembark-truck driver4 truck2 s9)
   deleted: (driving driver4 truck2)
   added: (at driver4 s9) (empty truck2)
   goals met: 13 of 17
96. (board-truck driver4 truck7 s9)
   deleted: (at driver4 s9) (empty truck7)
   added: (driving driver4 truck7)
   goals met: 13 of 17
97. (drive-truck truck7 s9 s0 driver4)
   deleted: (at truck7 s9)
   added: (at truck7 s0)
   changed: (driven) from 1799 to 1890
   goals met: 13 of 17
98. (walk driver3 s3 p9-3)
   deleted: (at driver3 s3)
   added: (at driver3 p9-3)
   changed: (walked) from 719 to 755
   goals met: 12 of 17
99. (walk driver3 p9-3 s9)
   deleted: (at driver3 p9-3)
   added: (at driver3 s9)
   changed: (walked) from 755 to 835
   goals met: 12 of 17
100. (board-truck driver3 truck2 s9)
   deleted: (at driver3 s9) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 12 of 17
101. (drive-truck truck2 s9 s8 driver3)
   deleted: (at truck2 s9)
   added: (at truck2 s8)
   changed: (driven) from 1890 to 1893
   goals met: 13 of 17
102. (disembark-truck driver3 truck2 s8)
   deleted: (driving driver3 truck2)
   added: (at driver3 s8) (empty truck2)
   goals met: 13 of 17
103. (walk driver1 p1-3 s1)
   deleted: (at driver1 p1-3)
   added: (at driver1 s1)
   changed: (walked) from 835 to 855
   goals met: 14 of 17
104. (disembark-truck driver4 truck7 s0)
   deleted: (driving driver4 truck7)
   added: (at driver4 s0) (empty truck7)
   goals met: 15 of 17
105. (walk driver3 s8 p5-8)
   deleted: (at driver3 s8)
   added: (at driver3 p5-8)
   changed: (walked) from 855 to 937
   goals met: 15 of 17
106. (walk driver3 p5-8 s5)
   deleted: (at driver3 p5-8)
   added: (at driver3 s5)
   changed: (walked) from 937 to 1034
   goals met: 15 of 17
107. (walk driver3 s5 p3-5)
   deleted: (at driver3 s5)
   added: (at driver3 p3-5)
   changed: (walked) from 1034 to 1084
   goals met: 15 of 17
108. (walk driver3 p3-5 s3)
   deleted: (at driver3 p3-5)
   added: (at driver3 s3)
   changed: (walked) from 1084 to 1142
   goals met: 16 of 17
109. (board-truck driver4 truck7 s0)
   deleted: (at driver4 s0) (empty truck7)
   added: (driving driver4 truck7)
   goals met: 15 of 17
110. (drive-truck truck7 s0 s9 driver4)
   deleted: (at truck7 s0)
   added: (at truck7 s9)
   changed: (driven) from 1893 to 1984
   goals met: 15 of 17
111. (drive-truck truck7 s9 s4 driver4)
   deleted: (at truck7 s9)
   added: (at truck7 s4)
   changed: (driven) from 1984 to 2073
   goals met: 16 of 17
112. (disembark-truck driver4 truck7 s4)
   deleted: (driving driver4 truck7)
   added: (at driver4 s4) (empty truck7)
   goals met: 16 of 17
113. (walk driver4 s4 p4-0)
   deleted: (at driver4 s4)
   added: (at driver4 p4-0)
   changed: (walked) from 1142 to 1216
   goals met: 16 of 17
114. (walk driver4 p4-0 s0)
   deleted: (at driver4 p4-0)
   added: (at driver4 s0)
   changed: (walked) from 1216 to 1256
   goals met: 17 of 17
